{
    "Name": "ECO Dataset",
    "Labeled": "Yes",
    "Time Series": "Yes",
    "Simulation": "No",
    "Missing Values": "No",
    "Dataset Characteristics": "Multivariate, Time-Series",
    "Feature Type": "Real",
    "Associated Tasks": "Non-Intrusive Load Monitoring, Occupancy Detection",
    "Number of Instances": "INA",
    "Number of Features": "INA",
    "Date Donated": "INA",
    "Source": "ETH Zurich",
    "Summary": "The ECO dataset includes electricity consumption and occupancy data from six Swiss households, collected over eight months for non-intrusive load monitoring and occupancy detection research.",
    "Sections": [
        {
            "Title": "Dataset Information",
            "Content": "This website provides access to the ECO data set (Electricity Consumption and Occupancy). The ECO data set is a comprehensive data set for non-intrusive load monitoring and occupancy detection research. It was collected in 6 Swiss households over a period of 8 months. For each of the households, the ECO data set provides:\n1 Hz aggregate consumption data. Each measurement contains data on current, voltage, and phase shift for each of the three phases in the household.\n1 Hz plug-level data measured from selected appliances.\nOccupancy information measured through a tablet computer (manual labeling) and a passive infrared sensor (in some of the households).\nWe make the ECO data set available to the research community. You may directly access the data set, but we always like to receive a short description on what you plan to do with the data via e-mail to Wilhelm Kleiminger."
        },
        {
            "Title": "Project Context",
            "Content": "The data was collected in the context of the project Smart Meter Services. The project is related to the open source framework NILM-Eval, in which we utilize the ECO data set to evaluate a set of non-intrusive load monitoring algorithms and our work on opportunistic occupancy sensing. We have also published the OpenWrt package Pylon, which allows for obtaining measurements from SML-based smart electricity meters."
        }
    ],
    "Additional Tags": [
        "Electricity consumption",
        "Occupancy detection",
        "Smart meters",
        "Energy efficiency",
        "Household data"
    ],
    "References": [
        {
            "Text": "ETH Zurich - ECO Dataset Page",
            "Link": "http://vs.inf.ethz.ch/res/show.html?what=eco-data"
        }
    ]
}
