{
    "Name": "Industrial Safety and Health Analytics Database",
    "Labeled": "Yes",
    "Time Series": "No",
    "Simulation": "No",
    "Missing Values": "No",
    "Dataset Characteristics": "Multivariate",
    "Feature Type": "Categorical, Integer",
    "Associated Tasks": "Classification, Analysis",
    "Number of Instances": "INA",
    "Number of Features": "INA",
    "Date Donated": "INA",
    "Source": "Kaggle",
    "Summary": "Industrial labor accident data.",
    "Sections": [
        {
            "Title": "Dataset Information",
            "Content": "It is not always easy to find databases from real-world manufacturing plants So, I would like to share this database with the community, which comes from one of the biggest industry in Brazil and in the world.\nThe primary reason why we are sharing this data is that there is an urgent need for companies to understand why employees still suffer some injuries/accidents in plants. Sometimes they also die in such environment. So hope the community help us to explore and take better/newer insights from this data."
        },
        {
            "Title": "Content",
            "Content": "The database is basically records of accidents from 12 different plants in 03 different countries where every line in the data is an occurrence of an accident.\n\nColumns description\nData: timestamp or time/date information\nCountries: which country the accident occurred (anonymized)\nLocal: the city where the manufacturing plant is located (anonymized)\nIndustry sector: which sector the plant belongs to\nAccident level: from I to VI, it registers how severe was the accident (I means not severe but VI means very severe)\nPotential Accident Level: Depending on the Accident Level, the database also registers how severe the accident could have been (due to other factors involved in the accident)\nGenre: if the person is male or female\nEmployee or Third Party: if the injured person is an employee or a third party\nCritical Risk: some description of the risk involved in the accident\nDescription: Detailed description of how the accident happened."
        }
    ],
    "Additional Tags": [
        "Workplace safety",
        "Health and safety",
        "Accident reports",
        "Risk management"
    ],
    "References": [
        {
            "Text": "Kaggle Dataset",
            "Link": "https://www.kaggle.com/datasets/ihmstefanini/industrial-safety-and-health-analytics-database"
        }
    ]
}
