{
    "Name": "Manufacturing Defects",
    "Labeled": "Yes",
    "Time Series": "No",
    "Simulation": "No",
    "Missing Values": "No",
    "Dataset Characteristics": "Multivariate",
    "Feature Type": "Real",
    "Associated Tasks": "Classification",
    "Number of Instances": "INA",
    "Number of Features": "INA",
    "Date Donated": "INA",
    "Source": "Kaggle",
    "Summary": "Ten days of data on parts defects.",
    "Sections": [
        {
            "Title": "Dataset Information",
            "Content": "Defect sampling is used in industrial settings to determine the types and amounts of defects in manufactured items. Items at various stages of production are removed from the process and inspected for defects. Sustained testing allows operations managers to discover whether some part of the manufacturing process is failing to meet performance criteria and product standards. To minimize manufacturing defects, early detection and problem resolution are critical.\n\nIn the current sampling plan, one component from the production line is randomly selected every 15 minutes. Each component is inspected and tested for major and minor defects. Major defects, which affect component performance, must be addressed immediately. Fortunately, major defects are rare and are generally contained and corrected early in the process. Minor defects, such as nicks and scratches, are those that affect the appearance of a component but not its functionality.\n\nThe data set contains ten days of data on minor defects. Each day, one item is tested every fifteen minutes during an eight-hour shift. The variables in the data set are:\n\nDay - Day of the test: 1 – 10\nSample - Time of the day that sample was taken in military time (e.g., 13:00 is 1pm)\nDefects - Number of minor defects detected on the sampled item."
        }
    ],
    "Additional Tags": [
        "Manufacturing defects",
        "Quality control",
        "Predictive modeling",
        "Industrial analysis",
        "Process optimization"
    ],
    "References": [
        {
            "Text": "Kaggle Dataset",
            "Link": "https://www.kaggle.com/datasets/gabrielsantello/manufacturing-defects-industry-dataset"
        }
    ]
}
