{
    "Name": "Mercedes-Benz Greener Manufacturing",
    "Labeled": "Yes",
    "Time Series": "No",
    "Simulation": "No",
    "Missing Values": "No",
    "Dataset Characteristics": "Multivariate",
    "Feature Type": "Real",
    "Associated Tasks": "Regression",
    "Number of Instances": "INA",
    "Number of Features": "INA",
    "Date Donated": "INA",
    "Source": "Kaggle",
    "Summary": "Reduce the time a Mercedes-Benz spends on the test bench.",
    "Sections": [
        {
            "Title": "Dataset Information",
            "Content": "Since the first automobile, the Benz Patent Motor Car in 1886, Mercedes-Benz has stood for important automotive innovations. These include the passenger safety cell with a crumple zone, the airbag, and intelligent assistance systems. Mercedes-Benz applies for nearly 2000 patents per year, making the brand the European leader among premium carmakers. Mercedes-Benz is the leader in the premium car industry. With a huge selection of features and options, customers can choose the customized Mercedes-Benz of their dreams.\n\nTo ensure the safety and reliability of every unique car configuration before they hit the road, the company’s engineers have developed a robust testing system. As one of the world’s biggest manufacturers of premium cars, safety and efficiency are paramount on Mercedes-Benz’s production lines. However, optimizing the speed of their testing system for many possible feature combinations is complex and time-consuming without a powerful algorithmic approach."
        },
        {
            "Title": "Content",
            "Content": "What's inside is more than just rows and columns. Make it easy for others to get started by describing how you acquired the data and what time period it represents, too."
        }
    ],
    "Additional Tags": [
        "Automotive manufacturing",
        "Efficiency optimization",
        "Environmental sustainability",
        "Predictive modeling"
    ],
    "References": [
        {
            "Text": "Kaggle Dataset",
            "Link": "https://www.kaggle.com/datasets/swetashetye/mercedesbenz-greener-manufacturing"
        }
    ]
}
