{
    "Name": "PHM 2008 Challenge",
    "Labeled": "Yes",
    "Time Series": "Yes",
    "Simulation": "No",
    "Missing Values": "No",
    "Dataset Characteristics": "Time-Series, Multivariate",
    "Feature Type": "Real",
    "Associated Tasks": "Prognostics",
    "Number of Instances": "INA",
    "Number of Features": "INA",
    "Date Donated": "2008",
    "Source": "NASA",
    "Summary": "This dataset represents multivariate time series data from different aircraft engines, used for a prognostics challenge at PHM08, focusing on engine degradation under various operational settings.",
    "Sections": [
        {
            "Title": "Dataset Information",
            "Content": "This dataset describes the degradation of an aircraft engine. The dataset was used for the prognostics challenge competition at the International Conference on Prognostics and Health Management (PHM08). The challenge is still open for the researchers to develop and compare their efforts against the winners of the challenge in 2008. Data sets consist of multiple multivariate time series. Each data set is further divided into training and test subsets. Each time series is from a different aircraft engine – i.e., the data can be considered to be from a fleet of engines of the same type. Each engine starts with different degrees of initial wear and manufacturing variation which is unknown to the user. This wear and variation is considered normal, i.e., it is not considered a fault condition. There are three operational settings that have a substantial effect on engine performance. These settings are also included in the data. The data are contaminated with sensor noise."
        }
    ],
    "Additional Tags": [
        "Aircraft engines",
        "Prognostics challenge",
        "Sensor noise",
        "Operational settings",
        "Engine degradation"
    ],
    "References": [
        {
            "Text": "NASA Open Data Portal",
            "Link": "https://data.nasa.gov/Raw-Data/PHM-2008-Challenge/nk8v-ckry/data"
        }
    ]
}