{
    "Name": "Severstal Steel Defect Detection",
    "Labeled": "Yes",
    "Time Series": "No",
    "Simulation": "No",
    "Missing Values": "No",
    "Dataset Characteristics": "Image, Multivariate",
    "Feature Type": "N/A",
    "Associated Tasks": "Classification",
    "Number of Instances": "N/A",
    "Number of Features": "N/A",
    "Date Donated": "2019",
    "Source": "Kaggle",
    "Summary": "The dataset consists of steel plate images, and the goal is to detect and classify four different types of defects on the surface of the steel. The images are labeled with the type of defect present.",
    "Sections": [
        {
            "Title": "Dataset Information",
            "Content": "Steel is one of the most important building materials of modern times. Steel buildings are resistant to natural and man-made wear which has made the material ubiquitous around the world. To help make production of steel more efficient, this competition will help identify defects.\n\nSeverstal is leading the charge in efficient steel mining and production. They believe the future of metallurgy requires development across the economic, ecological, and social aspects of the industry—and they take corporate responsibility seriously. The company recently created the country’s largest industrial data lake, with petabytes of data that were previously discarded. Severstal is now looking to machine learning to improve automation, increase efficiency, and maintain high quality in their production.\n\nThe production process of flat sheet steel is especially delicate. From heating and rolling, to drying and cutting, several machines touch flat steel by the time it’s ready to ship. Today, Severstal uses images from high frequency cameras to power a defect detection algorithm.\n\nIn this competition, you’ll help engineers improve the algorithm by localizing and classifying surface defects on a steel sheet.\n\nIf successful, you’ll help keep manufacturing standards for steel high and enable Severstal to continue their innovation, leading to a stronger, more efficient world all around us."
        }
    ],
    "Additional Tags": [
        "Steel defects",
        "Surface defects",
        "Industrial quality control",
        "Image classification",
        "Machine learning"
    ],
    "References": [
        {
            "Text": "Kaggle Competition",
            "Link": "https://www.kaggle.com/c/severstal-steel-defect-detection"
        }
    ]
}
